IntergatedCircuits/STM32_XPD/STM32F4_XPD/src/xpd_rcc_gen.c
/**
  ******************************************************************************
  * @file    xpd_rcc_gen.c
  * @author  Benedek Kupper
  * @version V0.2
  * @date    2016-11-05
  * @brief   STM32 eXtensible Peripheral Drivers RCC Peripherals Module
  *
  *  This file is part of STM32_XPD.
  *
  *  STM32_XPD is free software: you can redistribute it and/or modify
  *  it under the terms of the GNU General Public License as published by
  *  the Free Software Foundation, either version 3 of the License, or
  *  (at your option) any later version.
  *
  *  STM32_XPD is distributed in the hope that it will be useful,
  *  but WITHOUT ANY WARRANTY; without even the implied warranty of
  *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  *  GNU General Public License for more details.
  *
  *  You should have received a copy of the GNU General Public License
  *  along with STM32_XPD.  If not, see <http://www.gnu.org/licenses/>.
  */
#include "xpd_rcc.h"

/** @addtogroup RCC
 * @{ */

/** @addtogroup RCC_Peripheral_Control
 * @{ */

/** @addtogroup RCC_Generated_Functions
 * @{ */
#ifdef RCC_APB2RSTR_ADCRST
/** @brief Forces and releases a reset on the ADC peripheral. */
void XPD_ADC_Reset(void)
{
    RCC_REG_BIT(APB2RSTR,ADCRST) = 1;
    RCC_REG_BIT(APB2RSTR,ADCRST) = 0;
}
#endif
#ifdef RCC_APB2ENR_ADC1EN
/** @brief Sets the new clock state of the ADC1 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_ADC1_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2ENR,ADC1EN) = NewState;
    NewState = (FunctionalState)RCC->APB2ENR.w;
}
#endif
#ifdef RCC_APB2LPENR_ADC1LPEN
/** @brief Sets the clock state of the ADC1 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_ADC1_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2LPENR,ADC1LPEN) = NewState;
}
#endif
#ifdef RCC_APB2ENR_ADC2EN
/** @brief Sets the new clock state of the ADC2 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_ADC2_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2ENR,ADC2EN) = NewState;
    NewState = (FunctionalState)RCC->APB2ENR.w;
}
#endif
#ifdef RCC_APB2LPENR_ADC2LPEN
/** @brief Sets the clock state of the ADC2 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_ADC2_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2LPENR,ADC2LPEN) = NewState;
}
#endif
#ifdef RCC_APB2ENR_ADC3EN
/** @brief Sets the new clock state of the ADC3 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_ADC3_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2ENR,ADC3EN) = NewState;
    NewState = (FunctionalState)RCC->APB2ENR.w;
}
#endif
#ifdef RCC_APB2LPENR_ADC3LPEN
/** @brief Sets the clock state of the ADC3 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_ADC3_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2LPENR,ADC3LPEN) = NewState;
}
#endif
#ifdef RCC_AHB1ENR_BKPSRAMEN
/** @brief Sets the new clock state of the BKPSRAM peripheral.
 *  @param NewState: the new clock state to set */
void XPD_BKPSRAM_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1ENR,BKPSRAMEN) = NewState;
    NewState = (FunctionalState)RCC->AHB1ENR.w;
}
#endif
#ifdef RCC_AHB1LPENR_BKPSRAMLPEN
/** @brief Sets the clock state of the BKPSRAM peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_BKPSRAM_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1LPENR,BKPSRAMLPEN) = NewState;
}
#endif
#ifdef RCC_APB1ENR_CAN1EN
/** @brief Sets the new clock state of the CAN1 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_CAN1_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,CAN1EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_CAN1LPEN
/** @brief Sets the clock state of the CAN1 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_CAN1_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,CAN1LPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_CAN1RST
/** @brief Forces and releases a reset on the CAN1 peripheral. */
void XPD_CAN1_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,CAN1RST) = 1;
    RCC_REG_BIT(APB1RSTR,CAN1RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_CAN2EN
/** @brief Sets the new clock state of the CAN2 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_CAN2_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,CAN2EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_CAN2LPEN
/** @brief Sets the clock state of the CAN2 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_CAN2_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,CAN2LPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_CAN2RST
/** @brief Forces and releases a reset on the CAN2 peripheral. */
void XPD_CAN2_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,CAN2RST) = 1;
    RCC_REG_BIT(APB1RSTR,CAN2RST) = 0;
}
#endif
#ifdef RCC_AHB1ENR_CCMDATARAMEN
/** @brief Sets the new clock state of the CCMDATARAM peripheral.
 *  @param NewState: the new clock state to set */
void XPD_CCMDATARAM_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1ENR,CCMDATARAMEN) = NewState;
    NewState = (FunctionalState)RCC->AHB1ENR.w;
}
#endif
#ifdef RCC_APB1ENR_CECEN
/** @brief Sets the new clock state of the CEC peripheral.
 *  @param NewState: the new clock state to set */
void XPD_CEC_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,CECEN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_CECLPEN
/** @brief Sets the clock state of the CEC peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_CEC_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,CECLPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_CECRST
/** @brief Forces and releases a reset on the CEC peripheral. */
void XPD_CEC_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,CECRST) = 1;
    RCC_REG_BIT(APB1RSTR,CECRST) = 0;
}
#endif
#ifdef RCC_AHB1ENR_CRCEN
/** @brief Sets the new clock state of the CRC peripheral.
 *  @param NewState: the new clock state to set */
void XPD_CRC_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1ENR,CRCEN) = NewState;
    NewState = (FunctionalState)RCC->AHB1ENR.w;
}
#endif
#ifdef RCC_AHB1LPENR_CRCLPEN
/** @brief Sets the clock state of the CRC peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_CRC_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1LPENR,CRCLPEN) = NewState;
}
#endif
#ifdef RCC_AHB1RSTR_CRCRST
/** @brief Forces and releases a reset on the CRC peripheral. */
void XPD_CRC_Reset(void)
{
    RCC_REG_BIT(AHB1RSTR,CRCRST) = 1;
    RCC_REG_BIT(AHB1RSTR,CRCRST) = 0;
}
#endif
#ifdef RCC_AHB2ENR_CRYPEN
/** @brief Sets the new clock state of the CRYP peripheral.
 *  @param NewState: the new clock state to set */
void XPD_CRYP_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB2ENR,CRYPEN) = NewState;
    NewState = (FunctionalState)RCC->AHB2ENR.w;
}
#endif
#ifdef RCC_AHB2LPENR_CRYPLPEN
/** @brief Sets the clock state of the CRYP peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_CRYP_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB2LPENR,CRYPLPEN) = NewState;
}
#endif
#ifdef RCC_AHB2RSTR_CRYPRST
/** @brief Forces and releases a reset on the CRYP peripheral. */
void XPD_CRYP_Reset(void)
{
    RCC_REG_BIT(AHB2RSTR,CRYPRST) = 1;
    RCC_REG_BIT(AHB2RSTR,CRYPRST) = 0;
}
#endif
#ifdef RCC_APB1ENR_DACEN
/** @brief Sets the new clock state of the DAC peripheral.
 *  @param NewState: the new clock state to set */
void XPD_DAC_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,DACEN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_DACLPEN
/** @brief Sets the clock state of the DAC peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_DAC_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,DACLPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_DACRST
/** @brief Forces and releases a reset on the DAC peripheral. */
void XPD_DAC_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,DACRST) = 1;
    RCC_REG_BIT(APB1RSTR,DACRST) = 0;
}
#endif
#ifdef RCC_AHB2ENR_DCMIEN
/** @brief Sets the new clock state of the DCMI peripheral.
 *  @param NewState: the new clock state to set */
void XPD_DCMI_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB2ENR,DCMIEN) = NewState;
    NewState = (FunctionalState)RCC->AHB2ENR.w;
}
#endif
#ifdef RCC_AHB2LPENR_DCMILPEN
/** @brief Sets the clock state of the DCMI peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_DCMI_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB2LPENR,DCMILPEN) = NewState;
}
#endif
#ifdef RCC_AHB2RSTR_DCMIRST
/** @brief Forces and releases a reset on the DCMI peripheral. */
void XPD_DCMI_Reset(void)
{
    RCC_REG_BIT(AHB2RSTR,DCMIRST) = 1;
    RCC_REG_BIT(AHB2RSTR,DCMIRST) = 0;
}
#endif
#ifdef RCC_APB2ENR_DFSDM1EN
/** @brief Sets the new clock state of the DFSDM1 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_DFSDM1_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2ENR,DFSDM1EN) = NewState;
    NewState = (FunctionalState)RCC->APB2ENR.w;
}
#endif
#ifdef RCC_APB2LPENR_DFSDM1LPEN
/** @brief Sets the clock state of the DFSDM1 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_DFSDM1_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2LPENR,DFSDM1LPEN) = NewState;
}
#endif
#ifdef RCC_APB2RSTR_DFSDM1RST
/** @brief Forces and releases a reset on the DFSDM1 peripheral. */
void XPD_DFSDM1_Reset(void)
{
    RCC_REG_BIT(APB2RSTR,DFSDM1RST) = 1;
    RCC_REG_BIT(APB2RSTR,DFSDM1RST) = 0;
}
#endif
#ifdef RCC_AHB1ENR_DMA1EN
/** @brief Sets the new clock state of the DMA1 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_DMA1_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1ENR,DMA1EN) = NewState;
    NewState = (FunctionalState)RCC->AHB1ENR.w;
}
#endif
#ifdef RCC_AHB1LPENR_DMA1LPEN
/** @brief Sets the clock state of the DMA1 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_DMA1_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1LPENR,DMA1LPEN) = NewState;
}
#endif
#ifdef RCC_AHB1RSTR_DMA1RST
/** @brief Forces and releases a reset on the DMA1 peripheral. */
void XPD_DMA1_Reset(void)
{
    RCC_REG_BIT(AHB1RSTR,DMA1RST) = 1;
    RCC_REG_BIT(AHB1RSTR,DMA1RST) = 0;
}
#endif
#ifdef RCC_AHB1ENR_DMA2EN
/** @brief Sets the new clock state of the DMA2 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_DMA2_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1ENR,DMA2EN) = NewState;
    NewState = (FunctionalState)RCC->AHB1ENR.w;
}
#endif
#ifdef RCC_AHB1LPENR_DMA2LPEN
/** @brief Sets the clock state of the DMA2 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_DMA2_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1LPENR,DMA2LPEN) = NewState;
}
#endif
#ifdef RCC_AHB1RSTR_DMA2RST
/** @brief Forces and releases a reset on the DMA2 peripheral. */
void XPD_DMA2_Reset(void)
{
    RCC_REG_BIT(AHB1RSTR,DMA2RST) = 1;
    RCC_REG_BIT(AHB1RSTR,DMA2RST) = 0;
}
#endif
#ifdef RCC_AHB1ENR_DMA2DEN
/** @brief Sets the new clock state of the DMA2D peripheral.
 *  @param NewState: the new clock state to set */
void XPD_DMA2D_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1ENR,DMA2DEN) = NewState;
    NewState = (FunctionalState)RCC->AHB1ENR.w;
}
#endif
#ifdef RCC_AHB1LPENR_DMA2DLPEN
/** @brief Sets the clock state of the DMA2D peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_DMA2D_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1LPENR,DMA2DLPEN) = NewState;
}
#endif
#ifdef RCC_AHB1RSTR_DMA2DRST
/** @brief Forces and releases a reset on the DMA2D peripheral. */
void XPD_DMA2D_Reset(void)
{
    RCC_REG_BIT(AHB1RSTR,DMA2DRST) = 1;
    RCC_REG_BIT(AHB1RSTR,DMA2DRST) = 0;
}
#endif
#ifdef RCC_APB2ENR_DSIEN
/** @brief Sets the new clock state of the DSI peripheral.
 *  @param NewState: the new clock state to set */
void XPD_DSI_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2ENR,DSIEN) = NewState;
    NewState = (FunctionalState)RCC->APB2ENR.w;
}
#endif
#ifdef RCC_APB2LPENR_DSILPEN
/** @brief Sets the clock state of the DSI peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_DSI_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2LPENR,DSILPEN) = NewState;
}
#endif
#ifdef RCC_APB2RSTR_DSIRST
/** @brief Forces and releases a reset on the DSI peripheral. */
void XPD_DSI_Reset(void)
{
    RCC_REG_BIT(APB2RSTR,DSIRST) = 1;
    RCC_REG_BIT(APB2RSTR,DSIRST) = 0;
}
#endif
#ifdef RCC_AHB1ENR_ETHMACEN
/** @brief Sets the new clock state of the ETHMAC peripheral.
 *  @param NewState: the new clock state to set */
void XPD_ETHMAC_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1ENR,ETHMACEN) = NewState;
    NewState = (FunctionalState)RCC->AHB1ENR.w;
}
#endif
#ifdef RCC_AHB1LPENR_ETHMACLPEN
/** @brief Sets the clock state of the ETHMAC peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_ETHMAC_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1LPENR,ETHMACLPEN) = NewState;
}
#endif
#ifdef RCC_AHB1RSTR_ETHMACRST
/** @brief Forces and releases a reset on the ETHMAC peripheral. */
void XPD_ETHMAC_Reset(void)
{
    RCC_REG_BIT(AHB1RSTR,ETHMACRST) = 1;
    RCC_REG_BIT(AHB1RSTR,ETHMACRST) = 0;
}
#endif
#ifdef RCC_AHB1ENR_ETHMACPTPEN
/** @brief Sets the new clock state of the ETHMAC_PTP peripheral.
 *  @param NewState: the new clock state to set */
void XPD_ETHMAC_PTP_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1ENR,ETHMACPTPEN) = NewState;
    NewState = (FunctionalState)RCC->AHB1ENR.w;
}
#endif
#ifdef RCC_AHB1LPENR_ETHMACPTPLPEN
/** @brief Sets the clock state of the ETHMAC_PTP peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_ETHMAC_PTP_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1LPENR,ETHMACPTPLPEN) = NewState;
}
#endif
#ifdef RCC_AHB1ENR_ETHMACRXEN
/** @brief Sets the new clock state of the ETHMAC_RX peripheral.
 *  @param NewState: the new clock state to set */
void XPD_ETHMAC_RX_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1ENR,ETHMACRXEN) = NewState;
    NewState = (FunctionalState)RCC->AHB1ENR.w;
}
#endif
#ifdef RCC_AHB1LPENR_ETHMACRXLPEN
/** @brief Sets the clock state of the ETHMAC_RX peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_ETHMAC_RX_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1LPENR,ETHMACRXLPEN) = NewState;
}
#endif
#ifdef RCC_AHB1ENR_ETHMACTXEN
/** @brief Sets the new clock state of the ETHMAC_TX peripheral.
 *  @param NewState: the new clock state to set */
void XPD_ETHMAC_TX_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1ENR,ETHMACTXEN) = NewState;
    NewState = (FunctionalState)RCC->AHB1ENR.w;
}
#endif
#ifdef RCC_AHB1LPENR_ETHMACTXLPEN
/** @brief Sets the clock state of the ETHMAC_TX peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_ETHMAC_TX_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1LPENR,ETHMACTXLPEN) = NewState;
}
#endif
#ifdef RCC_APB2ENR_EXTITEN
/** @brief Sets the new clock state of the EXTI peripheral.
 *  @param NewState: the new clock state to set */
void XPD_EXTI_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2ENR,EXTITEN) = NewState;
    NewState = (FunctionalState)RCC->APB2ENR.w;
}
#endif
#ifdef RCC_APB2LPENR_EXTITLPEN
/** @brief Sets the clock state of the EXTI peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_EXTI_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2LPENR,EXTITLPEN) = NewState;
}
#endif
#ifdef RCC_AHB1LPENR_FLITFLPEN
/** @brief Sets the clock state of the FLITF peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_FLITF_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1LPENR,FLITFLPEN) = NewState;
}
#endif
#ifdef RCC_AHB3ENR_FMCEN
/** @brief Sets the new clock state of the FMC peripheral.
 *  @param NewState: the new clock state to set */
void XPD_FMC_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB3ENR,FMCEN) = NewState;
    NewState = (FunctionalState)RCC->AHB3ENR.w;
}
#endif
#ifdef RCC_AHB3LPENR_FMCLPEN
/** @brief Sets the clock state of the FMC peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_FMC_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB3LPENR,FMCLPEN) = NewState;
}
#endif
#ifdef RCC_AHB3RSTR_FMCRST
/** @brief Forces and releases a reset on the FMC peripheral. */
void XPD_FMC_Reset(void)
{
    RCC_REG_BIT(AHB3RSTR,FMCRST) = 1;
    RCC_REG_BIT(AHB3RSTR,FMCRST) = 0;
}
#endif
#ifdef RCC_APB1ENR_FMPI2C1EN
/** @brief Sets the new clock state of the FMP_I2C1 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_FMP_I2C1_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,FMPI2C1EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_FMPI2C1LPEN
/** @brief Sets the clock state of the FMP_I2C1 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_FMP_I2C1_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,FMPI2C1LPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_FMPI2C1RST
/** @brief Forces and releases a reset on the FMP_I2C1 peripheral. */
void XPD_FMP_I2C1_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,FMPI2C1RST) = 1;
    RCC_REG_BIT(APB1RSTR,FMPI2C1RST) = 0;
}
#endif
#ifdef RCC_AHB3ENR_FSMCEN
/** @brief Sets the new clock state of the FSMC peripheral.
 *  @param NewState: the new clock state to set */
void XPD_FSMC_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB3ENR,FSMCEN) = NewState;
    NewState = (FunctionalState)RCC->AHB3ENR.w;
}
#endif
#ifdef RCC_AHB3LPENR_FSMCLPEN
/** @brief Sets the clock state of the FSMC peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_FSMC_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB3LPENR,FSMCLPEN) = NewState;
}
#endif
#ifdef RCC_AHB3RSTR_FSMCRST
/** @brief Forces and releases a reset on the FSMC peripheral. */
void XPD_FSMC_Reset(void)
{
    RCC_REG_BIT(AHB3RSTR,FSMCRST) = 1;
    RCC_REG_BIT(AHB3RSTR,FSMCRST) = 0;
}
#endif
#ifdef RCC_AHB1ENR_GPIOAEN
/** @brief Sets the new clock state of the GPIOA peripheral.
 *  @param NewState: the new clock state to set */
void XPD_GPIOA_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1ENR,GPIOAEN) = NewState;
    NewState = (FunctionalState)RCC->AHB1ENR.w;
}
#endif
#ifdef RCC_AHB1LPENR_GPIOALPEN
/** @brief Sets the clock state of the GPIOA peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_GPIOA_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1LPENR,GPIOALPEN) = NewState;
}
#endif
#ifdef RCC_AHB1RSTR_GPIOARST
/** @brief Forces and releases a reset on the GPIOA peripheral. */
void XPD_GPIOA_Reset(void)
{
    RCC_REG_BIT(AHB1RSTR,GPIOARST) = 1;
    RCC_REG_BIT(AHB1RSTR,GPIOARST) = 0;
}
#endif
#ifdef RCC_AHB1ENR_GPIOBEN
/** @brief Sets the new clock state of the GPIOB peripheral.
 *  @param NewState: the new clock state to set */
void XPD_GPIOB_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1ENR,GPIOBEN) = NewState;
    NewState = (FunctionalState)RCC->AHB1ENR.w;
}
#endif
#ifdef RCC_AHB1LPENR_GPIOBLPEN
/** @brief Sets the clock state of the GPIOB peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_GPIOB_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1LPENR,GPIOBLPEN) = NewState;
}
#endif
#ifdef RCC_AHB1RSTR_GPIOBRST
/** @brief Forces and releases a reset on the GPIOB peripheral. */
void XPD_GPIOB_Reset(void)
{
    RCC_REG_BIT(AHB1RSTR,GPIOBRST) = 1;
    RCC_REG_BIT(AHB1RSTR,GPIOBRST) = 0;
}
#endif
#ifdef RCC_AHB1ENR_GPIOCEN
/** @brief Sets the new clock state of the GPIOC peripheral.
 *  @param NewState: the new clock state to set */
void XPD_GPIOC_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1ENR,GPIOCEN) = NewState;
    NewState = (FunctionalState)RCC->AHB1ENR.w;
}
#endif
#ifdef RCC_AHB1LPENR_GPIOCLPEN
/** @brief Sets the clock state of the GPIOC peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_GPIOC_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1LPENR,GPIOCLPEN) = NewState;
}
#endif
#ifdef RCC_AHB1RSTR_GPIOCRST
/** @brief Forces and releases a reset on the GPIOC peripheral. */
void XPD_GPIOC_Reset(void)
{
    RCC_REG_BIT(AHB1RSTR,GPIOCRST) = 1;
    RCC_REG_BIT(AHB1RSTR,GPIOCRST) = 0;
}
#endif
#ifdef RCC_AHB1ENR_GPIODEN
/** @brief Sets the new clock state of the GPIOD peripheral.
 *  @param NewState: the new clock state to set */
void XPD_GPIOD_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1ENR,GPIODEN) = NewState;
    NewState = (FunctionalState)RCC->AHB1ENR.w;
}
#endif
#ifdef RCC_AHB1LPENR_GPIODLPEN
/** @brief Sets the clock state of the GPIOD peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_GPIOD_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1LPENR,GPIODLPEN) = NewState;
}
#endif
#ifdef RCC_AHB1RSTR_GPIODRST
/** @brief Forces and releases a reset on the GPIOD peripheral. */
void XPD_GPIOD_Reset(void)
{
    RCC_REG_BIT(AHB1RSTR,GPIODRST) = 1;
    RCC_REG_BIT(AHB1RSTR,GPIODRST) = 0;
}
#endif
#ifdef RCC_AHB1ENR_GPIOEEN
/** @brief Sets the new clock state of the GPIOE peripheral.
 *  @param NewState: the new clock state to set */
void XPD_GPIOE_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1ENR,GPIOEEN) = NewState;
    NewState = (FunctionalState)RCC->AHB1ENR.w;
}
#endif
#ifdef RCC_AHB1LPENR_GPIOELPEN
/** @brief Sets the clock state of the GPIOE peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_GPIOE_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1LPENR,GPIOELPEN) = NewState;
}
#endif
#ifdef RCC_AHB1RSTR_GPIOERST
/** @brief Forces and releases a reset on the GPIOE peripheral. */
void XPD_GPIOE_Reset(void)
{
    RCC_REG_BIT(AHB1RSTR,GPIOERST) = 1;
    RCC_REG_BIT(AHB1RSTR,GPIOERST) = 0;
}
#endif
#ifdef RCC_AHB1ENR_GPIOFEN
/** @brief Sets the new clock state of the GPIOF peripheral.
 *  @param NewState: the new clock state to set */
void XPD_GPIOF_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1ENR,GPIOFEN) = NewState;
    NewState = (FunctionalState)RCC->AHB1ENR.w;
}
#endif
#ifdef RCC_AHB1LPENR_GPIOFLPEN
/** @brief Sets the clock state of the GPIOF peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_GPIOF_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1LPENR,GPIOFLPEN) = NewState;
}
#endif
#ifdef RCC_AHB1RSTR_GPIOFRST
/** @brief Forces and releases a reset on the GPIOF peripheral. */
void XPD_GPIOF_Reset(void)
{
    RCC_REG_BIT(AHB1RSTR,GPIOFRST) = 1;
    RCC_REG_BIT(AHB1RSTR,GPIOFRST) = 0;
}
#endif
#ifdef RCC_AHB1ENR_GPIOGEN
/** @brief Sets the new clock state of the GPIOG peripheral.
 *  @param NewState: the new clock state to set */
void XPD_GPIOG_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1ENR,GPIOGEN) = NewState;
