IntergatedCircuits/STM32_XPD/STM32F4_XPD/src/xpd_rcc_gen.c
    NewState = (FunctionalState)RCC->AHB1ENR.w;
}
#endif
#ifdef RCC_AHB1LPENR_GPIOGLPEN
/** @brief Sets the clock state of the GPIOG peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_GPIOG_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1LPENR,GPIOGLPEN) = NewState;
}
#endif
#ifdef RCC_AHB1RSTR_GPIOGRST
/** @brief Forces and releases a reset on the GPIOG peripheral. */
void XPD_GPIOG_Reset(void)
{
    RCC_REG_BIT(AHB1RSTR,GPIOGRST) = 1;
    RCC_REG_BIT(AHB1RSTR,GPIOGRST) = 0;
}
#endif
#ifdef RCC_AHB1ENR_GPIOHEN
/** @brief Sets the new clock state of the GPIOH peripheral.
 *  @param NewState: the new clock state to set */
void XPD_GPIOH_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1ENR,GPIOHEN) = NewState;
    NewState = (FunctionalState)RCC->AHB1ENR.w;
}
#endif
#ifdef RCC_AHB1LPENR_GPIOHLPEN
/** @brief Sets the clock state of the GPIOH peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_GPIOH_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1LPENR,GPIOHLPEN) = NewState;
}
#endif
#ifdef RCC_AHB1RSTR_GPIOHRST
/** @brief Forces and releases a reset on the GPIOH peripheral. */
void XPD_GPIOH_Reset(void)
{
    RCC_REG_BIT(AHB1RSTR,GPIOHRST) = 1;
    RCC_REG_BIT(AHB1RSTR,GPIOHRST) = 0;
}
#endif
#ifdef RCC_AHB1ENR_GPIOIEN
/** @brief Sets the new clock state of the GPIOI peripheral.
 *  @param NewState: the new clock state to set */
void XPD_GPIOI_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1ENR,GPIOIEN) = NewState;
    NewState = (FunctionalState)RCC->AHB1ENR.w;
}
#endif
#ifdef RCC_AHB1LPENR_GPIOILPEN
/** @brief Sets the clock state of the GPIOI peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_GPIOI_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1LPENR,GPIOILPEN) = NewState;
}
#endif
#ifdef RCC_AHB1RSTR_GPIOIRST
/** @brief Forces and releases a reset on the GPIOI peripheral. */
void XPD_GPIOI_Reset(void)
{
    RCC_REG_BIT(AHB1RSTR,GPIOIRST) = 1;
    RCC_REG_BIT(AHB1RSTR,GPIOIRST) = 0;
}
#endif
#ifdef RCC_AHB1ENR_GPIOJEN
/** @brief Sets the new clock state of the GPIOJ peripheral.
 *  @param NewState: the new clock state to set */
void XPD_GPIOJ_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1ENR,GPIOJEN) = NewState;
    NewState = (FunctionalState)RCC->AHB1ENR.w;
}
#endif
#ifdef RCC_AHB1LPENR_GPIOJLPEN
/** @brief Sets the clock state of the GPIOJ peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_GPIOJ_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1LPENR,GPIOJLPEN) = NewState;
}
#endif
#ifdef RCC_AHB1RSTR_GPIOJRST
/** @brief Forces and releases a reset on the GPIOJ peripheral. */
void XPD_GPIOJ_Reset(void)
{
    RCC_REG_BIT(AHB1RSTR,GPIOJRST) = 1;
    RCC_REG_BIT(AHB1RSTR,GPIOJRST) = 0;
}
#endif
#ifdef RCC_AHB1ENR_GPIOKEN
/** @brief Sets the new clock state of the GPIOK peripheral.
 *  @param NewState: the new clock state to set */
void XPD_GPIOK_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1ENR,GPIOKEN) = NewState;
    NewState = (FunctionalState)RCC->AHB1ENR.w;
}
#endif
#ifdef RCC_AHB1LPENR_GPIOKLPEN
/** @brief Sets the clock state of the GPIOK peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_GPIOK_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1LPENR,GPIOKLPEN) = NewState;
}
#endif
#ifdef RCC_AHB1RSTR_GPIOKRST
/** @brief Forces and releases a reset on the GPIOK peripheral. */
void XPD_GPIOK_Reset(void)
{
    RCC_REG_BIT(AHB1RSTR,GPIOKRST) = 1;
    RCC_REG_BIT(AHB1RSTR,GPIOKRST) = 0;
}
#endif
#ifdef RCC_AHB2ENR_HASHEN
/** @brief Sets the new clock state of the HASH peripheral.
 *  @param NewState: the new clock state to set */
void XPD_HASH_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB2ENR,HASHEN) = NewState;
    NewState = (FunctionalState)RCC->AHB2ENR.w;
}
#endif
#ifdef RCC_AHB2LPENR_HASHLPEN
/** @brief Sets the clock state of the HASH peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_HASH_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB2LPENR,HASHLPEN) = NewState;
}
#endif
#ifdef RCC_AHB2RSTR_HASHRST
/** @brief Forces and releases a reset on the HASH peripheral. */
void XPD_HASH_Reset(void)
{
    RCC_REG_BIT(AHB2RSTR,HASHRST) = 1;
    RCC_REG_BIT(AHB2RSTR,HASHRST) = 0;
}
#endif
#ifdef RCC_APB1ENR_I2C1EN
/** @brief Sets the new clock state of the I2C1 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_I2C1_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,I2C1EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_I2C1LPEN
/** @brief Sets the clock state of the I2C1 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_I2C1_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,I2C1LPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_I2C1RST
/** @brief Forces and releases a reset on the I2C1 peripheral. */
void XPD_I2C1_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,I2C1RST) = 1;
    RCC_REG_BIT(APB1RSTR,I2C1RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_I2C2EN
/** @brief Sets the new clock state of the I2C2 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_I2C2_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,I2C2EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_I2C2LPEN
/** @brief Sets the clock state of the I2C2 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_I2C2_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,I2C2LPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_I2C2RST
/** @brief Forces and releases a reset on the I2C2 peripheral. */
void XPD_I2C2_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,I2C2RST) = 1;
    RCC_REG_BIT(APB1RSTR,I2C2RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_I2C3EN
/** @brief Sets the new clock state of the I2C3 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_I2C3_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,I2C3EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_I2C3LPEN
/** @brief Sets the clock state of the I2C3 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_I2C3_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,I2C3LPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_I2C3RST
/** @brief Forces and releases a reset on the I2C3 peripheral. */
void XPD_I2C3_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,I2C3RST) = 1;
    RCC_REG_BIT(APB1RSTR,I2C3RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_LPTIM1EN
/** @brief Sets the new clock state of the LPTIM1 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_LPTIM1_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,LPTIM1EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_LPTIM1LPEN
/** @brief Sets the clock state of the LPTIM1 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_LPTIM1_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,LPTIM1LPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_LPTIM1RST
/** @brief Forces and releases a reset on the LPTIM1 peripheral. */
void XPD_LPTIM1_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,LPTIM1RST) = 1;
    RCC_REG_BIT(APB1RSTR,LPTIM1RST) = 0;
}
#endif
#ifdef RCC_APB2ENR_LTDCEN
/** @brief Sets the new clock state of the LTDC peripheral.
 *  @param NewState: the new clock state to set */
void XPD_LTDC_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2ENR,LTDCEN) = NewState;
    NewState = (FunctionalState)RCC->APB2ENR.w;
}
#endif
#ifdef RCC_APB2LPENR_LTDCLPEN
/** @brief Sets the clock state of the LTDC peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_LTDC_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2LPENR,LTDCLPEN) = NewState;
}
#endif
#ifdef RCC_APB2RSTR_LTDCRST
/** @brief Forces and releases a reset on the LTDC peripheral. */
void XPD_LTDC_Reset(void)
{
    RCC_REG_BIT(APB2RSTR,LTDCRST) = 1;
    RCC_REG_BIT(APB2RSTR,LTDCRST) = 0;
}
#endif
#ifdef RCC_AHB2ENR_OTGFSEN
/** @brief Sets the new clock state of the OTG_FS peripheral.
 *  @param NewState: the new clock state to set */
void XPD_OTG_FS_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB2ENR,OTGFSEN) = NewState;
    NewState = (FunctionalState)RCC->AHB2ENR.w;
}
#endif
#ifdef RCC_AHB2LPENR_OTGFSLPEN
/** @brief Sets the clock state of the OTG_FS peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_OTG_FS_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB2LPENR,OTGFSLPEN) = NewState;
}
#endif
#ifdef RCC_AHB2RSTR_OTGFSRST
/** @brief Forces and releases a reset on the OTG_FS peripheral. */
void XPD_OTG_FS_Reset(void)
{
    RCC_REG_BIT(AHB2RSTR,OTGFSRST) = 1;
    RCC_REG_BIT(AHB2RSTR,OTGFSRST) = 0;
}
#endif
#ifdef RCC_AHB1RSTR_OTGHRST
/** @brief Forces and releases a reset on the OTG_HS peripheral. */
void XPD_OTG_HS_Reset(void)
{
    RCC_REG_BIT(AHB1RSTR,OTGHRST) = 1;
    RCC_REG_BIT(AHB1RSTR,OTGHRST) = 0;
}
#endif
#ifdef RCC_AHB1ENR_OTGHSEN
/** @brief Sets the new clock state of the OTG_HS peripheral.
 *  @param NewState: the new clock state to set */
void XPD_OTG_HS_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1ENR,OTGHSEN) = NewState;
    NewState = (FunctionalState)RCC->AHB1ENR.w;
}
#endif
#ifdef RCC_AHB1LPENR_OTGHSLPEN
/** @brief Sets the clock state of the OTG_HS peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_OTG_HS_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1LPENR,OTGHSLPEN) = NewState;
}
#endif
#ifdef RCC_AHB1ENR_OTGHSULPIEN
/** @brief Sets the new clock state of the OTG_HS_ULPI peripheral.
 *  @param NewState: the new clock state to set */
void XPD_OTG_HS_ULPI_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1ENR,OTGHSULPIEN) = NewState;
    NewState = (FunctionalState)RCC->AHB1ENR.w;
}
#endif
#ifdef RCC_AHB1LPENR_OTGHSULPILPEN
/** @brief Sets the clock state of the OTG_HS_ULPI peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_OTG_HS_ULPI_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1LPENR,OTGHSULPILPEN) = NewState;
}
#endif
#ifdef RCC_APB1ENR_PWREN
/** @brief Sets the new clock state of the PWR peripheral.
 *  @param NewState: the new clock state to set */
void XPD_PWR_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,PWREN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_PWRLPEN
/** @brief Sets the clock state of the PWR peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_PWR_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,PWRLPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_PWRRST
/** @brief Forces and releases a reset on the PWR peripheral. */
void XPD_PWR_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,PWRRST) = 1;
    RCC_REG_BIT(APB1RSTR,PWRRST) = 0;
}
#endif
#ifdef RCC_AHB3ENR_QSPIEN
/** @brief Sets the new clock state of the QSPI peripheral.
 *  @param NewState: the new clock state to set */
void XPD_QSPI_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB3ENR,QSPIEN) = NewState;
    NewState = (FunctionalState)RCC->AHB3ENR.w;
}
#endif
#ifdef RCC_AHB3LPENR_QSPILPEN
/** @brief Sets the clock state of the QSPI peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_QSPI_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB3LPENR,QSPILPEN) = NewState;
}
#endif
#ifdef RCC_AHB3RSTR_QSPIRST
/** @brief Forces and releases a reset on the QSPI peripheral. */
void XPD_QSPI_Reset(void)
{
    RCC_REG_BIT(AHB3RSTR,QSPIRST) = 1;
    RCC_REG_BIT(AHB3RSTR,QSPIRST) = 0;
}
#endif
#ifdef RCC_AHB2ENR_RNGEN
/** @brief Sets the new clock state of the RNG peripheral.
 *  @param NewState: the new clock state to set */
void XPD_RNG_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB2ENR,RNGEN) = NewState;
    NewState = (FunctionalState)RCC->AHB2ENR.w;
}
#endif
#ifdef RCC_AHB1ENR_RNGEN
/** @brief Sets the new clock state of the RNG peripheral.
 *  @param NewState: the new clock state to set */
void XPD_RNG_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1ENR,RNGEN) = NewState;
    NewState = (FunctionalState)RCC->AHB1ENR.w;
}
#endif
#ifdef RCC_AHB2LPENR_RNGLPEN
/** @brief Sets the clock state of the RNG peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_RNG_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB2LPENR,RNGLPEN) = NewState;
}
#endif
#ifdef RCC_AHB1LPENR_RNGLPEN
/** @brief Sets the clock state of the RNG peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_RNG_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1LPENR,RNGLPEN) = NewState;
}
#endif
#ifdef RCC_AHB2RSTR_RNGRST
/** @brief Forces and releases a reset on the RNG peripheral. */
void XPD_RNG_Reset(void)
{
    RCC_REG_BIT(AHB2RSTR,RNGRST) = 1;
    RCC_REG_BIT(AHB2RSTR,RNGRST) = 0;
}
#endif
#ifdef RCC_AHB1RSTR_RNGRST
/** @brief Forces and releases a reset on the RNG peripheral. */
void XPD_RNG_Reset(void)
{
    RCC_REG_BIT(AHB1RSTR,RNGRST) = 1;
    RCC_REG_BIT(AHB1RSTR,RNGRST) = 0;
}
#endif
#ifdef RCC_APB1ENR_RTCAPBEN
/** @brief Sets the new clock state of the RTC peripheral.
 *  @param NewState: the new clock state to set */
void XPD_RTC_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,RTCAPBEN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_RTCAPBLPEN
/** @brief Sets the clock state of the RTC peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_RTC_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,RTCAPBLPEN) = NewState;
}
#endif
#ifdef RCC_APB2ENR_SAI1EN
/** @brief Sets the new clock state of the SAI1 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_SAI1_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2ENR,SAI1EN) = NewState;
    NewState = (FunctionalState)RCC->APB2ENR.w;
}
#endif
#ifdef RCC_APB2LPENR_SAI1LPEN
/** @brief Sets the clock state of the SAI1 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_SAI1_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2LPENR,SAI1LPEN) = NewState;
}
#endif
#ifdef RCC_APB2RSTR_SAI1RST
/** @brief Forces and releases a reset on the SAI1 peripheral. */
void XPD_SAI1_Reset(void)
{
    RCC_REG_BIT(APB2RSTR,SAI1RST) = 1;
    RCC_REG_BIT(APB2RSTR,SAI1RST) = 0;
}
#endif
#ifdef RCC_APB2ENR_SAI2EN
/** @brief Sets the new clock state of the SAI2 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_SAI2_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2ENR,SAI2EN) = NewState;
    NewState = (FunctionalState)RCC->APB2ENR.w;
}
#endif
#ifdef RCC_APB2LPENR_SAI2LPEN
/** @brief Sets the clock state of the SAI2 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_SAI2_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2LPENR,SAI2LPEN) = NewState;
}
#endif
#ifdef RCC_APB2RSTR_SAI2RST
/** @brief Forces and releases a reset on the SAI2 peripheral. */
void XPD_SAI2_Reset(void)
{
    RCC_REG_BIT(APB2RSTR,SAI2RST) = 1;
    RCC_REG_BIT(APB2RSTR,SAI2RST) = 0;
}
#endif
#ifdef RCC_APB2ENR_SDIOEN
/** @brief Sets the new clock state of the SDIO peripheral.
 *  @param NewState: the new clock state to set */
void XPD_SDIO_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2ENR,SDIOEN) = NewState;
    NewState = (FunctionalState)RCC->APB2ENR.w;
}
#endif
#ifdef RCC_APB2LPENR_SDIOLPEN
/** @brief Sets the clock state of the SDIO peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_SDIO_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2LPENR,SDIOLPEN) = NewState;
}
#endif
#ifdef RCC_APB2RSTR_SDIORST
/** @brief Forces and releases a reset on the SDIO peripheral. */
void XPD_SDIO_Reset(void)
{
    RCC_REG_BIT(APB2RSTR,SDIORST) = 1;
    RCC_REG_BIT(APB2RSTR,SDIORST) = 0;
}
#endif
#ifdef RCC_APB1ENR_SPDIFRXEN
/** @brief Sets the new clock state of the SPDIF_RX peripheral.
 *  @param NewState: the new clock state to set */
void XPD_SPDIF_RX_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,SPDIFRXEN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_SPDIFRXLPEN
/** @brief Sets the clock state of the SPDIF_RX peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_SPDIF_RX_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,SPDIFRXLPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_SPDIFRXRST
/** @brief Forces and releases a reset on the SPDIF_RX peripheral. */
void XPD_SPDIF_RX_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,SPDIFRXRST) = 1;
    RCC_REG_BIT(APB1RSTR,SPDIFRXRST) = 0;
}
#endif
#ifdef RCC_APB2ENR_SPI1EN
/** @brief Sets the new clock state of the SPI1 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_SPI1_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2ENR,SPI1EN) = NewState;
    NewState = (FunctionalState)RCC->APB2ENR.w;
}
#endif
#ifdef RCC_APB2LPENR_SPI1LPEN
/** @brief Sets the clock state of the SPI1 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_SPI1_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2LPENR,SPI1LPEN) = NewState;
}
#endif
#ifdef RCC_APB2RSTR_SPI1RST
/** @brief Forces and releases a reset on the SPI1 peripheral. */
void XPD_SPI1_Reset(void)
{
    RCC_REG_BIT(APB2RSTR,SPI1RST) = 1;
    RCC_REG_BIT(APB2RSTR,SPI1RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_SPI2EN
/** @brief Sets the new clock state of the SPI2 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_SPI2_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,SPI2EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_SPI2LPEN
/** @brief Sets the clock state of the SPI2 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_SPI2_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,SPI2LPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_SPI2RST
/** @brief Forces and releases a reset on the SPI2 peripheral. */
void XPD_SPI2_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,SPI2RST) = 1;
    RCC_REG_BIT(APB1RSTR,SPI2RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_SPI3EN
/** @brief Sets the new clock state of the SPI3 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_SPI3_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,SPI3EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_SPI3LPEN
/** @brief Sets the clock state of the SPI3 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_SPI3_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,SPI3LPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_SPI3RST
/** @brief Forces and releases a reset on the SPI3 peripheral. */
void XPD_SPI3_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,SPI3RST) = 1;
    RCC_REG_BIT(APB1RSTR,SPI3RST) = 0;
}
#endif
#ifdef RCC_APB2ENR_SPI4EN
/** @brief Sets the new clock state of the SPI4 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_SPI4_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2ENR,SPI4EN) = NewState;
    NewState = (FunctionalState)RCC->APB2ENR.w;
}
#endif
#ifdef RCC_APB2LPENR_SPI4LPEN
/** @brief Sets the clock state of the SPI4 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_SPI4_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2LPENR,SPI4LPEN) = NewState;
}
#endif
#ifdef RCC_APB2RSTR_SPI4RST
/** @brief Forces and releases a reset on the SPI4 peripheral. */
void XPD_SPI4_Reset(void)
{
    RCC_REG_BIT(APB2RSTR,SPI4RST) = 1;
    RCC_REG_BIT(APB2RSTR,SPI4RST) = 0;
}
#endif
#ifdef RCC_APB2ENR_SPI5EN
/** @brief Sets the new clock state of the SPI5 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_SPI5_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2ENR,SPI5EN) = NewState;
    NewState = (FunctionalState)RCC->APB2ENR.w;
}
#endif
#ifdef RCC_APB2LPENR_SPI5LPEN
/** @brief Sets the clock state of the SPI5 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_SPI5_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2LPENR,SPI5LPEN) = NewState;
}
#endif
#ifdef RCC_APB2RSTR_SPI5RST
/** @brief Forces and releases a reset on the SPI5 peripheral. */
void XPD_SPI5_Reset(void)
{
    RCC_REG_BIT(APB2RSTR,SPI5RST) = 1;
    RCC_REG_BIT(APB2RSTR,SPI5RST) = 0;
}
#endif
#ifdef RCC_APB2ENR_SPI6EN
/** @brief Sets the new clock state of the SPI6 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_SPI6_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2ENR,SPI6EN) = NewState;
    NewState = (FunctionalState)RCC->APB2ENR.w;
}
#endif
#ifdef RCC_APB2LPENR_SPI6LPEN
/** @brief Sets the clock state of the SPI6 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_SPI6_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2LPENR,SPI6LPEN) = NewState;
}
#endif
#ifdef RCC_APB2RSTR_SPI6RST
/** @brief Forces and releases a reset on the SPI6 peripheral. */
void XPD_SPI6_Reset(void)
{
    RCC_REG_BIT(APB2RSTR,SPI6RST) = 1;
    RCC_REG_BIT(APB2RSTR,SPI6RST) = 0;
}
#endif
#ifdef RCC_AHB1LPENR_SRAM1LPEN
/** @brief Sets the clock state of the SRAM1 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_SRAM1_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1LPENR,SRAM1LPEN) = NewState;
}
#endif
#ifdef RCC_AHB1LPENR_SRAM2LPEN
/** @brief Sets the clock state of the SRAM2 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_SRAM2_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1LPENR,SRAM2LPEN) = NewState;
}
#endif
#ifdef RCC_AHB1LPENR_SRAM3LPEN
/** @brief Sets the clock state of the SRAM3 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_SRAM3_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHB1LPENR,SRAM3LPEN) = NewState;
}
#endif
#ifdef RCC_APB2ENR_SYSCFGEN
/** @brief Sets the new clock state of the SYSCFG peripheral.
 *  @param NewState: the new clock state to set */
void XPD_SYSCFG_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2ENR,SYSCFGEN) = NewState;
    NewState = (FunctionalState)RCC->APB2ENR.w;
}
#endif
#ifdef RCC_APB2LPENR_SYSCFGLPEN
/** @brief Sets the clock state of the SYSCFG peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_SYSCFG_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2LPENR,SYSCFGLPEN) = NewState;
}
#endif
#ifdef RCC_APB2RSTR_SYSCFGRST
/** @brief Forces and releases a reset on the SYSCFG peripheral. */
void XPD_SYSCFG_Reset(void)
{
    RCC_REG_BIT(APB2RSTR,SYSCFGRST) = 1;
    RCC_REG_BIT(APB2RSTR,SYSCFGRST) = 0;
}
#endif
#ifdef RCC_APB2ENR_TIM1EN
/** @brief Sets the new clock state of the TIM1 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_TIM1_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2ENR,TIM1EN) = NewState;
    NewState = (FunctionalState)RCC->APB2ENR.w;
}
#endif
#ifdef RCC_APB2LPENR_TIM1LPEN
