IntergatedCircuits/STM32_XPD/STM32F4_XPD/src/xpd_rcc_gen.c
/** @brief Sets the clock state of the TIM1 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_TIM1_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2LPENR,TIM1LPEN) = NewState;
}
#endif
#ifdef RCC_APB2RSTR_TIM1RST
/** @brief Forces and releases a reset on the TIM1 peripheral. */
void XPD_TIM1_Reset(void)
{
    RCC_REG_BIT(APB2RSTR,TIM1RST) = 1;
    RCC_REG_BIT(APB2RSTR,TIM1RST) = 0;
}
#endif
#ifdef RCC_APB2ENR_TIM10EN
/** @brief Sets the new clock state of the TIM10 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_TIM10_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2ENR,TIM10EN) = NewState;
    NewState = (FunctionalState)RCC->APB2ENR.w;
}
#endif
#ifdef RCC_APB2LPENR_TIM10LPEN
/** @brief Sets the clock state of the TIM10 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_TIM10_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2LPENR,TIM10LPEN) = NewState;
}
#endif
#ifdef RCC_APB2RSTR_TIM10RST
/** @brief Forces and releases a reset on the TIM10 peripheral. */
void XPD_TIM10_Reset(void)
{
    RCC_REG_BIT(APB2RSTR,TIM10RST) = 1;
    RCC_REG_BIT(APB2RSTR,TIM10RST) = 0;
}
#endif
#ifdef RCC_APB2ENR_TIM11EN
/** @brief Sets the new clock state of the TIM11 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_TIM11_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2ENR,TIM11EN) = NewState;
    NewState = (FunctionalState)RCC->APB2ENR.w;
}
#endif
#ifdef RCC_APB2LPENR_TIM11LPEN
/** @brief Sets the clock state of the TIM11 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_TIM11_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2LPENR,TIM11LPEN) = NewState;
}
#endif
#ifdef RCC_APB2RSTR_TIM11RST
/** @brief Forces and releases a reset on the TIM11 peripheral. */
void XPD_TIM11_Reset(void)
{
    RCC_REG_BIT(APB2RSTR,TIM11RST) = 1;
    RCC_REG_BIT(APB2RSTR,TIM11RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_TIM12EN
/** @brief Sets the new clock state of the TIM12 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_TIM12_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,TIM12EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_TIM12LPEN
/** @brief Sets the clock state of the TIM12 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_TIM12_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,TIM12LPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_TIM12RST
/** @brief Forces and releases a reset on the TIM12 peripheral. */
void XPD_TIM12_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,TIM12RST) = 1;
    RCC_REG_BIT(APB1RSTR,TIM12RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_TIM13EN
/** @brief Sets the new clock state of the TIM13 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_TIM13_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,TIM13EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_TIM13LPEN
/** @brief Sets the clock state of the TIM13 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_TIM13_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,TIM13LPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_TIM13RST
/** @brief Forces and releases a reset on the TIM13 peripheral. */
void XPD_TIM13_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,TIM13RST) = 1;
    RCC_REG_BIT(APB1RSTR,TIM13RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_TIM14EN
/** @brief Sets the new clock state of the TIM14 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_TIM14_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,TIM14EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_TIM14LPEN
/** @brief Sets the clock state of the TIM14 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_TIM14_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,TIM14LPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_TIM14RST
/** @brief Forces and releases a reset on the TIM14 peripheral. */
void XPD_TIM14_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,TIM14RST) = 1;
    RCC_REG_BIT(APB1RSTR,TIM14RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_TIM2EN
/** @brief Sets the new clock state of the TIM2 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_TIM2_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,TIM2EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_TIM2LPEN
/** @brief Sets the clock state of the TIM2 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_TIM2_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,TIM2LPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_TIM2RST
/** @brief Forces and releases a reset on the TIM2 peripheral. */
void XPD_TIM2_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,TIM2RST) = 1;
    RCC_REG_BIT(APB1RSTR,TIM2RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_TIM3EN
/** @brief Sets the new clock state of the TIM3 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_TIM3_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,TIM3EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_TIM3LPEN
/** @brief Sets the clock state of the TIM3 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_TIM3_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,TIM3LPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_TIM3RST
/** @brief Forces and releases a reset on the TIM3 peripheral. */
void XPD_TIM3_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,TIM3RST) = 1;
    RCC_REG_BIT(APB1RSTR,TIM3RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_TIM4EN
/** @brief Sets the new clock state of the TIM4 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_TIM4_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,TIM4EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_TIM4LPEN
/** @brief Sets the clock state of the TIM4 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_TIM4_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,TIM4LPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_TIM4RST
/** @brief Forces and releases a reset on the TIM4 peripheral. */
void XPD_TIM4_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,TIM4RST) = 1;
    RCC_REG_BIT(APB1RSTR,TIM4RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_TIM5EN
/** @brief Sets the new clock state of the TIM5 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_TIM5_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,TIM5EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_TIM5LPEN
/** @brief Sets the clock state of the TIM5 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_TIM5_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,TIM5LPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_TIM5RST
/** @brief Forces and releases a reset on the TIM5 peripheral. */
void XPD_TIM5_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,TIM5RST) = 1;
    RCC_REG_BIT(APB1RSTR,TIM5RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_TIM6EN
/** @brief Sets the new clock state of the TIM6 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_TIM6_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,TIM6EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_TIM6LPEN
/** @brief Sets the clock state of the TIM6 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_TIM6_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,TIM6LPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_TIM6RST
/** @brief Forces and releases a reset on the TIM6 peripheral. */
void XPD_TIM6_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,TIM6RST) = 1;
    RCC_REG_BIT(APB1RSTR,TIM6RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_TIM7EN
/** @brief Sets the new clock state of the TIM7 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_TIM7_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,TIM7EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_TIM7LPEN
/** @brief Sets the clock state of the TIM7 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_TIM7_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,TIM7LPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_TIM7RST
/** @brief Forces and releases a reset on the TIM7 peripheral. */
void XPD_TIM7_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,TIM7RST) = 1;
    RCC_REG_BIT(APB1RSTR,TIM7RST) = 0;
}
#endif
#ifdef RCC_APB2ENR_TIM8EN
/** @brief Sets the new clock state of the TIM8 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_TIM8_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2ENR,TIM8EN) = NewState;
    NewState = (FunctionalState)RCC->APB2ENR.w;
}
#endif
#ifdef RCC_APB2LPENR_TIM8LPEN
/** @brief Sets the clock state of the TIM8 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_TIM8_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2LPENR,TIM8LPEN) = NewState;
}
#endif
#ifdef RCC_APB2RSTR_TIM8RST
/** @brief Forces and releases a reset on the TIM8 peripheral. */
void XPD_TIM8_Reset(void)
{
    RCC_REG_BIT(APB2RSTR,TIM8RST) = 1;
    RCC_REG_BIT(APB2RSTR,TIM8RST) = 0;
}
#endif
#ifdef RCC_APB2ENR_TIM9EN
/** @brief Sets the new clock state of the TIM9 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_TIM9_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2ENR,TIM9EN) = NewState;
    NewState = (FunctionalState)RCC->APB2ENR.w;
}
#endif
#ifdef RCC_APB2LPENR_TIM9LPEN
/** @brief Sets the clock state of the TIM9 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_TIM9_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2LPENR,TIM9LPEN) = NewState;
}
#endif
#ifdef RCC_APB2RSTR_TIM9RST
/** @brief Forces and releases a reset on the TIM9 peripheral. */
void XPD_TIM9_Reset(void)
{
    RCC_REG_BIT(APB2RSTR,TIM9RST) = 1;
    RCC_REG_BIT(APB2RSTR,TIM9RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_UART4EN
/** @brief Sets the new clock state of the UART4 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_UART4_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,UART4EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_UART4LPEN
/** @brief Sets the clock state of the UART4 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_UART4_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,UART4LPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_UART4RST
/** @brief Forces and releases a reset on the UART4 peripheral. */
void XPD_UART4_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,UART4RST) = 1;
    RCC_REG_BIT(APB1RSTR,UART4RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_UART5EN
/** @brief Sets the new clock state of the UART5 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_UART5_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,UART5EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_UART5LPEN
/** @brief Sets the clock state of the UART5 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_UART5_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,UART5LPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_UART5RST
/** @brief Forces and releases a reset on the UART5 peripheral. */
void XPD_UART5_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,UART5RST) = 1;
    RCC_REG_BIT(APB1RSTR,UART5RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_UART7EN
/** @brief Sets the new clock state of the UART7 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_UART7_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,UART7EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_UART7LPEN
/** @brief Sets the clock state of the UART7 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_UART7_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,UART7LPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_UART7RST
/** @brief Forces and releases a reset on the UART7 peripheral. */
void XPD_UART7_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,UART7RST) = 1;
    RCC_REG_BIT(APB1RSTR,UART7RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_UART8EN
/** @brief Sets the new clock state of the UART8 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_UART8_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,UART8EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_UART8LPEN
/** @brief Sets the clock state of the UART8 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_UART8_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,UART8LPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_UART8RST
/** @brief Forces and releases a reset on the UART8 peripheral. */
void XPD_UART8_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,UART8RST) = 1;
    RCC_REG_BIT(APB1RSTR,UART8RST) = 0;
}
#endif
#ifdef RCC_APB2ENR_USART1EN
/** @brief Sets the new clock state of the USART1 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_USART1_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2ENR,USART1EN) = NewState;
    NewState = (FunctionalState)RCC->APB2ENR.w;
}
#endif
#ifdef RCC_APB2LPENR_USART1LPEN
/** @brief Sets the clock state of the USART1 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_USART1_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2LPENR,USART1LPEN) = NewState;
}
#endif
#ifdef RCC_APB2RSTR_USART1RST
/** @brief Forces and releases a reset on the USART1 peripheral. */
void XPD_USART1_Reset(void)
{
    RCC_REG_BIT(APB2RSTR,USART1RST) = 1;
    RCC_REG_BIT(APB2RSTR,USART1RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_USART2EN
/** @brief Sets the new clock state of the USART2 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_USART2_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,USART2EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_USART2LPEN
/** @brief Sets the clock state of the USART2 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_USART2_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,USART2LPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_USART2RST
/** @brief Forces and releases a reset on the USART2 peripheral. */
void XPD_USART2_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,USART2RST) = 1;
    RCC_REG_BIT(APB1RSTR,USART2RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_USART3EN
/** @brief Sets the new clock state of the USART3 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_USART3_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,USART3EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_USART3LPEN
/** @brief Sets the clock state of the USART3 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_USART3_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,USART3LPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_USART3RST
/** @brief Forces and releases a reset on the USART3 peripheral. */
void XPD_USART3_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,USART3RST) = 1;
    RCC_REG_BIT(APB1RSTR,USART3RST) = 0;
}
#endif
#ifdef RCC_APB2ENR_USART6EN
/** @brief Sets the new clock state of the USART6 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_USART6_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2ENR,USART6EN) = NewState;
    NewState = (FunctionalState)RCC->APB2ENR.w;
}
#endif
#ifdef RCC_APB2LPENR_USART6LPEN
/** @brief Sets the clock state of the USART6 peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_USART6_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2LPENR,USART6LPEN) = NewState;
}
#endif
#ifdef RCC_APB2RSTR_USART6RST
/** @brief Forces and releases a reset on the USART6 peripheral. */
void XPD_USART6_Reset(void)
{
    RCC_REG_BIT(APB2RSTR,USART6RST) = 1;
    RCC_REG_BIT(APB2RSTR,USART6RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_WWDGEN
/** @brief Sets the new clock state of the WWDG peripheral.
 *  @param NewState: the new clock state to set */
void XPD_WWDG_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,WWDGEN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1LPENR_WWDGLPEN
/** @brief Sets the clock state of the WWDG peripheral during sleep mode.
 *  @param NewState: the new sleep clock state to set */
void XPD_WWDG_SleepClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1LPENR,WWDGLPEN) = NewState;
}
#endif
#ifdef RCC_APB1RSTR_WWDGRST
/** @brief Forces and releases a reset on the WWDG peripheral. */
void XPD_WWDG_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,WWDGRST) = 1;
    RCC_REG_BIT(APB1RSTR,WWDGRST) = 0;
}
#endif

/** @} */

/** @} */

/** @} */
